Revit 2027 API
DividedPath.IsValidMeasurementType Method
 Checks that the measurement type enumeration value is valid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidMeasurementType(
	DividedPathMeasurementType measurementType
)
Public Function IsValidMeasurementType (
	measurementType As DividedPathMeasurementType
) As Boolean
public:
bool IsValidMeasurementType(
	DividedPathMeasurementType measurementType
)
member IsValidMeasurementType :
        measurementType : DividedPathMeasurementType -> bool
Parameters
measurementType DividedPathMeasurementType
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace